Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItemEnumerator Methods
The MaterialMarketSizesItemEnumerator type exposes the following members.
Methods
Name | Description
MoveNext
 Moves to the next item in the MaterialMarketSizesItemEnumerator.
Reset
 Resets the MaterialMarketSizesItemEnumerator to the beginning.
Top
See Also
Reference
MaterialMarketSizesItemEnumerator Class
Tekla.Structures.Catalogs Namespace